### 以openml中的数据集1StudentPerfromance为例，求数学分数math score连续出现3次的分数。

In [1]:
# 导入数据集获取工具
from sklearn.datasets import fetch_openml
# 导入数据分析库
import pandas as pd

In [2]:
# 获取数据
data = fetch_openml(
    data_id=43255,
    as_frame=True,
    parser="pandas"
)["frame"]

In [3]:
# 查看数据集的前五行
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor\'s degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master\'s degree,standard,none,90,95,93
3,male,group A,associate\'s degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [4]:
# 一步差分结果，删除缺失值
diff1 = data["math score"].diff().dropna()
diff1

1      -3.0
2      21.0
3     -43.0
4      29.0
5      -5.0
       ...
995    25.0
996   -26.0
997    -3.0
998     9.0
999     9.0
Name: math score, Length: 999, dtype: float64

In [5]:
# 找到为零的那些元素，表示重复两次出现的值
diff1_zero = diff1[diff1==0]
diff1_zero

384    0.0
390    0.0
432    0.0
437    0.0
453    0.0
518    0.0
537    0.0
550    0.0
565    0.0
747    0.0
797    0.0
925    0.0
948    0.0
Name: math score, dtype: float64

In [6]:
# 再对一步差分结果中零的索引进行差分，若为零，则说明是三个连续值
result = pd.Series(diff1_zero.index).diff().dropna()
result[result==0]

Series([], dtype: float64)